# # Задача 1.  Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# # Пример:

# # - 6782 -> 23
# # - 0,56 -> 11


# str1=str(input())
# print(str1)
# k=0
# for elem in str1:
#     if elem.isdigit():
#         k += int(elem)
#         print(elem)
# print(f' - {str1} ->' ,k)


