# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

a = int(input('Введите номер дня недели от 1 до 7:  '))

if a == int(1) :
    print(f' - {a} - Рабочий')
elif a == int(2) :
    print(f' - {a} - Рабочий')
elif a == int(3) :
    print(f' - {a} - Рабочий')
elif a == int(4) :
    print(f' - {a} - Рабочий')
elif a == int(5) :
    print(f' - {a} - Рабочий')
elif a == int(6) :
    print(f' - {a} - Выходной')
elif a == int(7) :
    print(f' - {a} - Выходной')


    